{
  "CO_DATA": [
    {
      "CO": "CO1",
      "CO_Description": "Understand the concepts of information systems development life cycle , system analysis and design and software project management."
    },
    {
      "CO": "CO2",
      "CO_Description": "Apply software methodologies and techniques projects."
    },
    {
      "CO": "CO3",
      "CO_Description": "Determine and mode information system requirements."
    },
    {
      "CO": "CO4",
      "CO_Description": "Develop and manage an information system project."
    }
  ],
  "PO_DATA": [
    {
      "PO": "PO-a",
      "PO_Description": "Apply knowledge of computing, science, and mathematics in solving computing/IT -related problems through critical and creative thinking."
    },
    {
      "PO": "PO-b",
      "PO_Description": "Use current best practices and standards in solving complex computing/IT -related problems and requirements;"
    },
    {
      "PO": "PO-c",
      "PO_Description": "Analyze complex computing/IT - related problems by applying analytical and quantitative reasoning; and define the computing requirements appropriate to its solution;"
    },
    {
      "PO": "PO-d",
      "PO_Description": "Identify and analyze user needs and take them into account in the selection, creation, evaluation and administration of computer based - systems;"
    },
    {
      "PO": "PO-e",
      "PO_Description": "Design creatively, implement and evaluate different computer-based systems, processes, components, or programs to meet desired needs and requirements under various constraints;"
    },
    {
      "PO": "PO-f",
      "PO_Description": "Integrate effectively the IT-based solutions into the user environment with appropriate consideration for public health and safety, cultural, societal, and environmental concerns;"
    },
    {
      "PO": "PO-g",
      "PO_Description": "Select, adapt and apply appropriate techniques, resources, skills, and modern computing tools to complex computing activities, with an understanding of the limitations;"
    },
    {
      "PO": "PO-h",
      "PO_Description": "Function effectively as individual, or work collaboratively and respectfully as a member or leader in diverse development teams and in multidisciplinary and/or multicultural settings;."
    },
    {
      "PO": "PO-i",
      "PO_Description": "Assist in the creation of an effective IT project plan;"
    },
    {
      "PO": "PO-j",
      "PO_Description": "Communicate effectively in both oral and in written form by being able to deliver and comprehend instructions clearly; and present persuasively to diverse audience the complex computing / IT-related ideas and perspectives;"
    },
    {
      "PO": "PO-k",
      "PO_Description": "Assess local and global impact of computing information technology on individuals, organizations, and society;"
    },
    {
      "PO": "PO-l",
      "PO_Description": "Act in recognition of professional, ethical, legal, security and social responsibilities in the utilization of information technology;"
    },
    {
      "PO": "PO-m",
      "PO_Description": "Recognize the need to engage in independent learning and be at pace with the latest developments in a specialized field in IT, with emphasis on Database Management and Information System; Network Design and Administration; and Computer Vision and Image processing for continual development as a computing professional;"
    },
    {
      "PO": "PO-n",
      "PO_Description": "Participate in generation of new knowledge; or in research and development projects aligned to local and national development agenda or goals with the end view of contributing to the local and national economy;"
    },
    {
      "PO": "PO-o",
      "PO_Description": "Preserve and Promote “Filipino historical and cultural heritage”."
    }
  ]
}